REJECT_MSG = "❌"

ADD_ITEM_MSG_START_SUCCESS = "Введите наименование вещи\\."

ADD_ITEM_MSG_NAME_FAILURE = (
    "Наименование вещи должно быть указано в виде текстового значения "
    "длиной не более 64 символов\\."
)
ADD_ITEM_MSG_NAME_SUCCESS = "Введите наименование коллекции\\."

ADD_ITEM_MSG_COLLECTION_FAILURE = (
    "Наименование коллекции должно быть указано в виде текстового значения "
    "длиной не более 64 символов\\."
)
ADD_ITEM_MSG_COLLECTION_SUCCESS = "Введите объем тиража в виде целого числа\\."

ADD_ITEM_MSG_VOLUME_FAILURE = (
    "Объем тиража должен быть указан как целое число без дополнительных символов "
    "длиной не более 64 цифр\\."
)
ADD_ITEM_MSG_VOLUME_SUCCESS = "Отправьте изображение вещи\\."
